In [9]:
import pandas as pd

In [10]:
df = pd.read_csv('stock_data.csv')
df

,Datasource: Google finance,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4
0,tickers,eps,revenue,price,people
1,GOOGL,27.82,87,845,larry page
2,WMT,4.61,484,65,n.a.
3,MSFT,-1,85,64,bill gates
4,RIL,not available,50,1023,mukesh ambani
5,TATA,5.6,-1,n.a.,ratan tata

In [11]:
df = pd.read_csv('stock_data.csv',header=1)
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [12]:
df = pd.read_csv('stock_data.csv',header=1, names=['stock_symbol','eps','revenue','price','people'])
df

  stock_symbol            eps  revenue price         people
0        GOOGL          27.82       87   845     larry page
1          WMT           4.61      484    65           n.a.
2         MSFT             -1       85    64     bill gates
3         RIL   not available       50  1023  mukesh ambani
4         TATA            5.6       -1  n.a.     ratan tata

In [13]:
df = pd.read_csv('stock_data.csv',header=1, names=['stock_symbol','eps','revenue','price','people'] ,na_values= {
	'eps': ['not available'],
	'revenue': ['-1'],
	'price': ['n.a.'] 
}) # Specify column conversion to appropriate null values.
df

  stock_symbol    eps  revenue   price         people
0        GOOGL  27.82     87.0   845.0     larry page
1          WMT   4.61    484.0    65.0           n.a.
2         MSFT  -1.00     85.0    64.0     bill gates
3         RIL     NaN     50.0  1023.0  mukesh ambani
4         TATA   5.60      NaN     NaN     ratan tata

In [14]:
df = pd.read_csv('stock_data.csv',header=1, names=['stock_symbol','eps','revenue','price','people'],
				na_values = ['not available',-1,'n.a.']) # Convert all value to null if that values in list
df

  stock_symbol    eps  revenue   price         people
0        GOOGL  27.82     87.0   845.0     larry page
1          WMT   4.61    484.0    65.0            NaN
2         MSFT    NaN     85.0    64.0     bill gates
3         RIL     NaN     50.0  1023.0  mukesh ambani
4         TATA   5.60      NaN     NaN     ratan tata

In [15]:
df['pe'] = df['price']/df['eps']
df

  stock_symbol    eps  revenue   price         people         pe
0        GOOGL  27.82     87.0   845.0     larry page  30.373832
1          WMT   4.61    484.0    65.0            NaN  14.099783
2         MSFT    NaN     85.0    64.0     bill gates        NaN
3         RIL     NaN     50.0  1023.0  mukesh ambani        NaN
4         TATA   5.60      NaN     NaN     ratan tata        NaN

In [16]:
df.to_csv('pe.csv',index=False,header=False)
df

  stock_symbol    eps  revenue   price         people         pe
0        GOOGL  27.82     87.0   845.0     larry page  30.373832
1          WMT   4.61    484.0    65.0            NaN  14.099783
2         MSFT    NaN     85.0    64.0     bill gates        NaN
3         RIL     NaN     50.0  1023.0  mukesh ambani        NaN
4         TATA   5.60      NaN     NaN     ratan tata        NaN

In [17]:
pip install openpyxl # For install read excel file

Requirement already satisfied: openpyxl in c:\python313\lib\site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in c:\python313\lib\site-packages (from openpyxl) (2.0.0)
Note: you may need to restart the kernel to use updated packages.

In [18]:
df_movie = pd.read_excel('movies_db.xlsx','movies',index_col='movie_id')
df_movie.head() # Read Excel file

,title,industry,release_year,imdb_rating,studio,language_id
movie_id,,,,,,
101,K.G.F: Chapter 2,Bollywood,2022,8.4,Hombale Films,3
102,Doctor Strange in the Multiverse of Madness,Hollywood,2022,7.0,Marvel Studios,5
103,Thor: The Dark World,Hollywood,2013,6.8,Marvel Studios,5
104,Thor: Ragnarok,Hollywood,2017,7.9,Marvel Studios,5
105,Thor: Love and Thunder,Hollywood,2022,6.8,Marvel Studios,5

In [21]:
df_financial = pd.read_excel('movies_db.xlsx','financials',index_col='movie_id')
df_financial.head()

          budget  revenue      unit currency
movie_id
101          1.0     12.5  Billions      INR
102        200.0    954.8  Millions      USD
103        165.0    644.8  Millions       $$
104        180.0    854.0  Millions  Dollars
105        250.0    670.0  Millions      USD

In [24]:
def convert_d(d):
	if d == '$$' or d == 'Dollars':
		return 'USD'
	else:
		return d # Convert '$$' and 'Dollars' to 'USD'

df_financial = pd.read_excel('movies_db.xlsx','financials',index_col='movie_id',converters={
	'currency': convert_d # Use with function
})
df_financial.head()

          budget  revenue      unit currency
movie_id
101          1.0     12.5  Billions      INR
102        200.0    954.8  Millions      USD
103        165.0    644.8  Millions      USD
104        180.0    854.0  Millions      USD
105        250.0    670.0  Millions      USD

In [26]:
df_merged = pd.merge(df_movie,df_financial,on='movie_id')
df_merged.head()

,title,industry,release_year,imdb_rating,studio,language_id,budget,revenue,unit,currency
movie_id,,,,,,,,,,
101,K.G.F: Chapter 2,Bollywood,2022,8.4,Hombale Films,3,1.0,12.5,Billions,INR
102,Doctor Strange in the Multiverse of Madness,Hollywood,2022,7.0,Marvel Studios,5,200.0,954.8,Millions,USD
103,Thor: The Dark World,Hollywood,2013,6.8,Marvel Studios,5,165.0,644.8,Millions,USD
104,Thor: Ragnarok,Hollywood,2017,7.9,Marvel Studios,5,180.0,854.0,Millions,USD
105,Thor: Love and Thunder,Hollywood,2022,6.8,Marvel Studios,5,250.0,670.0,Millions,USD

In [29]:
df_merged.to_excel('movie_merged.xlsx') # Import excel file

In [32]:
df_stocks = pd.DataFrame({
	'Symbol':['GOOGL','WMT','MSFT'],
	'price':[845,65,64],
	'eps':[27.82,4.61,2.12]
})
df_stocks

  Symbol  price    eps
0  GOOGL    845  27.82
1    WMT     65   4.61
2   MSFT     64   2.12